-- npc: 마서
local spell = require('lib.spell')
local npc = require('lib.npc')

return {
    on_click = function(me, npc_obj)
    	local spells = {
    		['성황령'] = {
    			['level'] = 0,
    			['desc'] = '캐릭터가 죽었을 경우 사용하면 자신이 해당된 성내 성황당으로 이동하게 되는 마법이네.',
    			['material'] = { {['name'] = '도토리', ['count'] = 10}, {['name'] = '토끼고기', ['count'] = 10} }
    		},
    		['비영사천문'] = {
    			['level'] = 0,
    			['desc'] = '이 기술은 동,서,남,북으로 순식간에 이동할 수 있는 마법으로 필수적이면서도 가장 기본적인 마법이네.',
    			['material'] = { {['name'] = '도토리', ['count'] = 10}, {['name'] = '토끼고기', ['count'] = 10} }
    		},
    		['누리의기원'] = {
    			['level'] = 8,
    			['desc'] = '자신의 체력을 약간 회복하는 기술로써,자신의 체력만 회복 가능하여 그다지 중요하지 않은 기술이네.',
    			['material'] = { {['name'] = '금전', ['count'] = 30}, {['name'] = '도토리', ['count'] = 70} }
    		},
    		['대지의기원'] = {
    			['level'] = 12,
    			['desc'] = '약간의 체력을 회복하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 40}, {['name'] = '도토리', ['count'] = 70} }
    		},
    		['누리의빛'] = {
    			['level'] = 12,
    			['desc'] = '다른사람의 능력치를 훔쳐보는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 50}, {['name'] = '도토리', ['count'] = 50} }
    		},
    		['금수'] = {
    			['level'] = 14,
    			['desc'] = '고양이,새끼돼지,돼지,강아지,누렁이로 변신하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 50}, {['name'] = '토끼고기', ['count'] = 10} }
    		},
    		['누리의힘'] = {
    			['level'] = 15,
    			['desc'] = '자신의 마력을 불어넣어 힘을 일정시간 동안 높이는 마법으로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 50}, {['name'] = '뱀고기', ['count'] = 20} }
    		},
    		['대지의빛'] = {
    			['level'] = 17,
    			['desc'] = '다른 사람의 능력치를 훔쳐보는 기술로 시야에 보이는 모든 사람의 능력치를 훔쳐볼수있는 기술이라네.',
    			['material'] = { {['name'] = '금전', ['count'] = 150}, {['name'] = '도토리', ['count'] = 70}, {['name'] = '뱀고기', ['count'] = 30} }
    		},
    		[spell.CREATURE_SPELL(me:creature(), 1)] = {
    			['level'] = 18,
    			['desc'] = '신수의 속성을 가진 원거리 마법으로써,멀리서도 적을 공격할 수 있는 기술이네.',
    			['material'] = { {['name'] = '금전', ['count'] = 200}, {['name'] = '도토리', ['count'] = 30} }
    		},
    		['동해의기원'] = {
    			['level'] = 20,
    			['desc'] = '자신이나 다른 사람의 체력을 100만큼 회복시키는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 100}, {['name'] = '호랑이고기', ['count'] = 5} }
    		},
    		['무영보법'] = {
    			['level'] = 24,
    			['desc'] = '현란한 몸놀림으로 상대의 공격을 피하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 200}, {['name'] = '도토리', ['count'] = 80}, {['name'] = '토끼고기', ['count'] = 10} }
    		},
    		['경수'] = {
    			['level'] = 25,
    			['desc'] = '토끼,다람쥐로 변신하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 80}, {['name'] = '호랑이고기', ['count'] = 10} }
    		},
    		['바다의빛'] = {
    			['level'] = 28,
    			['desc'] = '다른 사람의 능력치와 가진 물건을 훔쳐보는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 200}, {['name'] = '도토리', ['count'] = 100}, {['name'] = '호랑이고기', ['count'] = 20} }
    		},
    		['이중공격'] = {
    			['level'] = 30,
    			['desc'] = '순간적으로 2번 연속 공격하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 300}, {['name'] = '도토리', ['count'] = 150}, {['name'] = '호랑이고기', ['count'] = 30} }
    		},
    		['야수'] = {
    			['level'] = 33,
    			['desc'] = '여우,늑대로 변신하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 80}, {['name'] = '여우모피', ['count'] = 10} }
    		},
    		['투명'] = {
    			['level'] = 34,
    			['desc'] = '자신의 몸을 숨겨 상대에게 기습을 가하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 400}, {['name'] = '도토리', ['count'] = 200}, {['name'] = '호랑이고기', ['count'] = 20}, {['name'] = '철도', ['count'] = 1} }
    		},
    		['출두'] = {
    			['level'] = 35,
    			['desc'] = '자신보다 낮은 레벨의 사람에게 순간적으로 이동하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 100}, {['name'] = '호랑이고기', ['count'] = 10} }
    		},
    		[spell.CREATURE_SPELL(me:creature(), 2)] = {
    			['level'] = 36,
    			['desc'] = '첫번째 신수마법의 다음 단계 기술로써,적에게 더욱 강력한 공격을 가할수 있는 마법이네.',
    			['material'] = { {['name'] = '금전', ['count'] = 500}, {['name'] = '도토리', ['count'] = 50}, {['name'] = '호랑이고기', ['count'] = 10} }
    		},
    		['비영승보'] = {
    			['level'] = 38,
    			['desc'] = '적의 등 뒤로 돌아서며 공격하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 400}, {['name'] = '도토리', ['count'] = 180}, {['name'] = '호랑이고기', ['count'] = 40} }
    		},
    		['맹수'] = {
    			['level'] = 40,
    			['desc'] = '곰과 호랑이로 변신하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 400}, {['name'] = '도토리', ['count'] = 80}, {['name'] = '웅담', ['count'] = 20}, {['name'] = '호랑이고기', ['count'] = 20} }
    		},
    		['망각'] = {
    			['level'] = 43,
    			['desc'] = '몬스터가 공격을 할 수 없게 만드는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 400}, {['name'] = '도토리', ['count'] = 80}, {['name'] = '웅담', ['count'] = 20}, {['name'] = '호랑이고기', ['count'] = 20} }
    		},
    		['귀환'] = {
    			['level'] = 45,
    			['desc'] = '자신의 나라 주막으로 이동하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 100} }
    		},
    		['천공의기원'] = {
    			['level'] = 48,
    			['desc'] = '자신 또는 다른 사람의 체력을 200만큼 회복하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 200}, {['name'] = '도토리', ['count'] = 100}, {['name'] = '웅담', ['count'] = 10} }
    		},
    		['필살검무'] = {
    			['level'] = 50,
    			['desc'] = '한번에 모든 기를 끌어올려 치명적인 가격을 하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 1000}, {['name'] = '도토리', ['count'] = 200}, {['name'] = '철도', ['count'] = 1}, {['name'] = '자호의가죽', ['count'] = 10} }
    		},
    		['소환'] = {
    			['level'] = 53,
    			['desc'] = '자신보다 낮은 레벨의 사람을 자신의 앞으로 소환하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 500}, {['name'] = '도토리', ['count'] = 100}, {['name'] = '자호의가죽', ['count'] = 2} }
    		},
    		['삼중공격'] = {
    			['level'] = 56,
    			['desc'] = '순간적으로 세 번 연속으로 공격하는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 1000}, {['name'] = '도토리', ['count'] = 180}, {['name'] = '야월도', ['count'] = 1}, {['name'] = '자호의가죽', ['count'] = 20} }
    		},
    		[spell.CREATURE_SPELL(me:creature(), 3)] = {
    			['level'] = 58,
    			['desc'] = '두번째 신수마법의 다음 단계 기술로써,적에게 더욱 강력한 공격을 가할수 있는 마법이네.',
    			['material'] = { {['name'] = '금전', ['count'] = 800}, {['name'] = '도토리', ['count'] = 130} }
    		},
    		['노획'] = {
    			['level'] = 65,
    			['desc'] = '마법력을 사용하여 앞쪽에 있는 물건을 재빠르게 집는 기술로써,',
    			['material'] = { {['name'] = '금전', ['count'] = 2000}, {['name'] = '도토리', ['count'] = 130}, {['name'] = '철검', ['count'] = 1} }
    		},
    		[spell.CREATURE_SPELL(me:creature(), 4)] = {
    			['level'] = 75,
    			['desc'] = '세번째 신수마법의 다음 단계 기술로써,적에게 더욱 강력한 공격을 가할수 있는 마법이네.',
    			['material'] = { {['name'] = '금전', ['count'] = 4000}, {['name'] = '도토리', ['count'] = 180}, {['name'] = '철단도', ['count'] = 1}, {['name'] = '호박', ['count'] = 5} }
    		},
    		['흡성대법'] = {
    			['level'] = 80,
    			['desc'] = '상대방의 체력을 흡수하는 기술이라네.',
    			['material'] = { {['name'] = '금전', ['count'] = 5000}, {['name'] = '도토리', ['count'] = 190}, {['name'] = '진호박', ['count'] = 10} }
    		},
    		['운기'] = {
    			['level'] = 90,
    			['desc'] = '동작을 멈추고 빠른 속도로 기력을 회복하는 기술이라네.',
    			['material'] = { {['name'] = '금전', ['count'] = 5000}, {['name'] = '도토리', ['count'] = 190}, {['name'] = '진호박', ['count'] = 10} }
    		},
    		['사자후도적'] = {
    			['level'] = 99,
    			['desc'] = '목소리에 공력을 실어 크게 외치는 기술로써,서버내 모든 유저들이 자신의 목소리를 들을 수 있게 해주는 기술이네.',
    			['material'] = { {['name'] = '금전', ['count'] = 5000}, {['name'] = '도토리', ['count'] = 200}, {['name'] = '진호박', ['count'] = 20} }
    		},
    		['분신'] = {
    			['level'] = 99,
    			['desc'] = '기를 집중하여 파괴력을 증강시키는 기술이라네.',
    			['material'] = { {['name'] = '금전', ['count'] = 6000}, {['name'] = '도토리', ['count'] = 200}, {['name'] = '진호박', ['count'] = 20}, {['name'] = '가시철단도', ['count'] = 1} }
    		}
    	}

    	npc.basic_class(me, npc_obj, CLASS.ROGUE, spells)
    end
}
