local spell = require('lib.spell')
local npc = require('lib.npc')

function NPC_26(me, npc_obj)
	local spells = {
		['성황령'] = {
			['level'] = 0,
			['desc'] = '캐릭터가 죽었을 경우 사용하면 자신이 해당된 성내 성황당으로 이동하게 되는 마법이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 10}, {['name'] = '토끼고기', ['count'] = 10}}
		},
		['비영사천문'] = {
			['level'] = 0,
			['desc'] = '이 기술은 동, 서, 남, 북으로 순식간에 이동할 수 있는 마법으로 필수적이면서도 가장 기본적인 마법이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 10}, {['name'] = '토끼고기', ['count'] = 10}}
		},
		['누리의기원'] = {
			['level'] = 5,
			['desc'] = '자신의 체력을 약간 회복하는 기술로써, 자신의 체력만 회복 가능하여 그다지 중요하지 않은 기술이네',
			['material'] = {{['name'] = '도토리', ['count'] = 10}, {['name'] = '토끼고기', ['count'] = 10}}
		},
		['바다의기원'] = {
			['level'] = 6,
			['desc'] = '자신의 체력을 약간 회복하는 기술로써, ',
			['material'] = {{['name'] = '도토리', ['count'] = 20}, {['name'] = '토끼고기', ['count'] = 10}}
		},
		[spell.CREATURE_SPELL(me:creature(), 1)] = {
			['level'] = 12,
			['desc'] = '신수의 속성을 가진 원거리 마법이네멀리서도 적을 공격할 수 있는 기술이네',
			['material'] = {{['name'] = '도토리', ['count'] = 20}, {['name'] = '토끼고기', ['count'] = 10}}
		},
		['공력증강'] = {
			['level'] = 14,
			['desc'] = '마력 소량과 일부 체력을 소모해서 마력을 완전히 회복시키는 기술로써, ',
			['material'] = {{['name'] = '도토리', ['count'] = 20}, {['name'] = '토끼고기', ['count'] = 10}}
		},
		['해독'] = {
			['level'] = 15,
			['desc'] = '중독을 푸는 회복 계열 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 50}, {['name'] = '뱀고기', ['count'] = 10}}
		},
		['천공의기원'] = {
			['level'] = 18,
			['desc'] = '자신이나 타인의 체력을 200만큼 회복시키는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 50}}
		},
		['무장'] = {
			['level'] = 22,
			['desc'] = '자신이나 타인의 갑옷강도를 일정시간동안 높여 피해를 줄이는 마법이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 60}, {['name'] = '뱀고기', ['count'] = 20}}
		},
		['보호'] = {
			['level'] = 24,
			['desc'] = '일정시간 동안 모든 공격으로부터의 피해를 절반으로 줄여주는 마법이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 80}}
		},
		['퇴마주'] = {
			['level'] = 25,
			['desc'] = '저주를 푸는 회복 계열의 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 60}}
		},
		['차폐'] = {
			['level'] = 27,
			['desc'] = '마력으로 보호막을 만들어 접근을 못하게 하는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 500}, {['name'] = '도토리', ['count'] = 70}, {['name'] = '자호의가죽', ['count'] = 5}}
		},
		['구름의기원'] = {
			['level'] = 30,
			['desc'] = '자신이나 타인의 체력을 500만큼 회복시켜주는 마법이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 40}, {['name'] = '뱀고기', ['count'] = 10}}
		},
		['출두'] = {
			['level'] = 30,
			['desc'] = '자신보다 낮은 레벨의 사람에게 순간적으로 이동하는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 50}}
		},
		['천공의희원'] = {
			['level'] = 33,
			['desc'] = '동시에 여러 사람의 체력을 200만큼 회복 시켜주는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 30}}
		},
		['귀환'] = {
			['level'] = 35,
			['desc'] = '자신의 나라의 주막으로 순간 이동하는 마법이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 20}}
		},
		['소환'] = {
			['level'] = 38,
			['desc'] = '자신보다 레벨이 낮은 사람을 자신의 앞으로 불러오는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 70}}
		},
		['활력'] = {
			['level'] = 39,
			['desc'] = '마비를 푸는 회복 계열의 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 50}}
		},
		['시력회복'] = {
			['level'] = 40,
			['desc'] = '절망을 푸는 회복 계열의 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 200}, {['name'] = '도토리', ['count'] = 20}}
		},
		['태양의기원'] = {
			['level'] = 45,
			['desc'] = '자신이나 타인의 체력을 1000만큼 회복시켜주는 마법이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 20}, {['name'] = '웅담', ['count'] = 1}, {['name'] = '동동주', ['count'] = 1}}
		},
		['파혼술'] = {
			['level'] = 53,
			['desc'] = '한번 걸리면 극히 치명적인 혼마술을 푸는 회복 계열의 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 200}, {['name'] = '도토리', ['count'] = 50}}
		},
		['구름의희원'] = {
			['level'] = 55,
			['desc'] = '동시에 여러명의 체력을 500씩 회복시키는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 500}, {['name'] = '도토리', ['count'] = 60}, {['name'] = '여우모피', ['count'] = 20}}
		},
		['심안투영'] = {
			['level'] = 58,
			['desc'] = '일정시간동안 마음의 눈으로 보이지 않는것을 감지하는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 500}, {['name'] = '도토리', ['count'] = 100}, {['name'] = '철도', ['count'] = 1}}
		},
		['혼마술'] = {
			['level'] = 60,
			['desc'] = '상대의 혼을 어지럽혀 방어력을 극도로 낮추는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 1000}, {['name'] = '도토리', ['count'] = 80}, {['name'] = '호박', ['count'] = 2}}
		},
		['공력주입'] = {
			['level'] = 65,
			['desc'] = '자신의 마력을 모두 소모해 다른 사람의 마력을 회복시켜주는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 500}, {['name'] = '도토리', ['count'] = 70}, {['name'] = '자호의가죽', ['count'] = 5}}
		},
		['소혼강신'] = {
			['level'] = 68,
			['desc'] = '몬스터를 소환해 자신의 부하로 만드는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 800}, {['name'] = '도토리', ['count'] = 100}, {['name'] = '자호의가죽', ['count'] = 2}, {['name'] = '적호의가죽', ['count'] = 1}}
		},
		['지진'] = {
			['level'] = 74,
			['desc'] = '일정 범위의 적들을 동시에 공격할 수 있는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 500}, {['name'] = '도토리', ['count'] = 80}, {['name'] = '호박', ['count'] = 5}}
		},
		['태양의희원'] = {
			['level'] = 80,
			['desc'] = '동시에 여러명의 체력을 1000씩 회복시켜주는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 800}, {['name'] = '도토리', ['count'] = 80}, {['name'] = '진호박', ['count'] = 1}}
		},
		['생명의기원'] = {
			['level'] = 83,
			['desc'] = '자신이나 타인의 체력을 5000만큼 회복시켜주는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 5000}, {['name'] = '도토리', ['count'] = 100}, {['name'] = '빨간시약', ['count'] = 1}, {['name'] = '진호박', ['count'] = 1}}
		},
		['금강불체'] = {
			['level'] = 85,
			['desc'] = '신의 가호를 빌어 잠시 동안 모든 피해를 무효화 시키는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 5000}, {['name'] = '도토리', ['count'] = 100}, {['name'] = '호박', ['count'] = 20}}
		},
		['무력화'] = {
			['level'] = 88,
			['desc'] = '대상에 걸려있는 모든 마법을 일시에 풀어버리는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 800}, {['name'] = '도토리', ['count'] = 80}, {['name'] = '해골죽장', ['count'] = 1}}
		},
		['환마술'] = {
			['level'] = 95,
			['desc'] = '황마를 소환하여 탑승하는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 27000}, {['name'] = '황금호박', ['count'] = 2}}
		},
		['사자후도사'] = {
			['level'] = 99,
			['desc'] = '목소리에 공력을 실어 크게 외치는 기술로써, 서버내 모든 유저들이 자신의 목소리를 들을 수 있게 해주는 기술이네',
			['material'] = {{['name'] = '금전', ['count'] = 5000}, {['name'] = '도토리', ['count'] = 100}, {['name'] = '진호박', ['count'] = 20}}
		},
		['부활'] = {
			['level'] = 99,
			['desc'] = '자신의 모든 마력을 소모해 사자의 육신에 다시 영혼을 불어넣는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 10000}, {['name'] = '도토리', ['count'] = 200}, {['name'] = '빨간시약', ['count'] = 2}, {['name'] = '진호박', ['count'] = 5}}
		}
	}

	npc.basic_class(me, npc_obj, CLASS.POET, spells)
end