function NPC_24(me, npc)
	local spells = {
		['성황령'] = {
			['level'] = 0,
			['desc'] = '캐릭터가 죽었을 경우 사용하면 자신이 해당된 성내 성황당으로 이동하게 되는 마법이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 10}, {['name'] = '토끼고기', ['count'] = 10}}
		},
		['비영사천문'] = {
			['level'] = 0,
			['desc'] = '이 기술은 동, 서, 남, 북으로 순식간에 이동할 수 있는 마법으로 필수적이면서도 가장 기본적인 마법이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 10}, {['name'] = '토끼고기', ['count'] = 10}}
		},
		['누리의기원'] = {
			['level'] = 5,
			['desc'] = '자신의 체력을 약간 회복하는 기술로써, 자신의 체력만 회복 가능하여 그다지 중요하지 않은 기술이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 10}, {['name'] = '토끼고기', ['count'] = 10}}
		},
		[CREATURE_SPELL(me:creature(), 1)] = {
			['level'] = 6,
			['desc'] = '신수 속성을 가진 원거리 마법으로써, 멀리서도 적을 공격할 수 있는 기술이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 10}, {['name'] = '토끼고기', ['count'] = 10}}
		},
		['대지의기원'] = {
			['level'] = 8,
			['desc'] = '약간의 체력을 회복하는 기술로써, 타인의 체력도 회복해 줄 수 있는 유요한 기술로 보이지 않는 적의 위치도 감지 할 수 있는 유용한 기술이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 10}, {['name'] = '토끼고기', ['count'] = 10}}
		},
		['무장'] = {
			['level'] = 10,
			['desc'] = '자신이나 타인의 갑옷 강도를 일정시간 높여 피해를 줄이는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 80}, {['name'] = '도토리', ['count'] = 60}}
		},
		['귀환'] = {
			['level'] = 13,
			['desc'] = '자신의 나라 주막으로 이동하는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 50}, {['name'] = '도토리', ['count'] = 30}}
		},
		[CREATURE_AREA_SPELL(me:creature(), 1)] = {
			['level'] = 14,
			['desc'] = '자신의 전후좌우 방향으로 동시에 신수마법을 시전하는 마법으로 많은 적을 공격 할 수 있다네.',
			['material'] = {{['name'] = '도토리', ['count'] = 50}}
		},
		['바다의기원'] = {
			['level'] = 16,
			['desc'] = '자신의 체력을 100만큼 회복하는 기술로써, 기초적인 회복마법이라네.',
			['material'] = {{['name'] = '금전', ['count'] = 70}, {['name'] = '도토리', ['count'] = 50}}
		},
		[CREATURE_SPELL(me:creature(), 2)] = {
			['level'] = 16,
			['desc'] = '첫번째 신수마법의 다음 단계 기술로써, 적에게 더욱 강력한 공격을 가할수 있는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 50}, {['name'] = '도토리', ['count'] = 70}}
		},
		['누리의힘'] = {
			['level'] = 17,
			['desc'] = '자신의 마력을 불어넣어 힘을 일정시간 동안 높이는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 50}, {['name'] = '도토리', ['count'] = 70}}
		},
		['동해의기원'] = {
			['level'] = 18,
			['desc'] = '자신이나 타인의 체력을 100만큼 회복시키는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 50}, {['name'] = '도토리', ['count'] = 50}}
		},
		['대지의힘'] = {
			['level'] = 19,
			['desc'] = '자신이나 타인에게 마력을 불어넣어 힘을 일정시간 동안 높히는 기술이네.',
			['material'] = {{['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 70}, {['name'] = '뱀고기', ['count'] = 20}}
		},
		['출두'] = {
			['level'] = 20,
			['desc'] = '자신보다 낮은 레벨의 사람에게 순간적으로 이동하는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 50}, {['name'] = '도토리', ['count'] = 50}, {['name'] = '뱀고기', ['count'] = 20}}
		},
		['하늘의기원'] = {
			['level'] = 23,
			['desc'] = '자신의 체력을 200만큼 회복시키는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 50}, {['name'] = '도토리', ['count'] = 50}, {['name'] = '뱀고기', ['count'] = 10}}
		},
		[CREATURE_AREA_SPELL(me:creature(), 2)] = {
			['level'] = 24,
			['desc'] = '자신의 전후좌우 방향으로 동시에 한층 강해진 신수마법을 시전하는 마법으로 많은 적을 공격 할 수 있다네.',
			['material'] = {{['name'] = '금전', ['count'] = 50}, {['name'] = '도토리', ['count'] = 30}, {['name'] = '곰가죽', ['count'] = 10}}
		},
		['해독'] = {
			['level'] = 25,
			['desc'] = '중독을 푸는 회복 계열의 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 60}, {['name'] = '녹용', ['count'] = 10}}
		},
		['천공의기원'] = {
			['level'] = 27,
			['desc'] = '자신이나 타인의 체력을 200만큼 회복시키는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 80}, {['name'] = '녹용', ['count'] = 20}}
		},
		['소환'] = {
			['level'] = 30,
			['desc'] = '자신보다 레벨이 낮은 사람을 자신의 앞으로 불러오는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 50}, {['name'] = '도토리', ['count'] = 80}, {['name'] = '뱀고기', ['count'] = 10}}
		},
		['활력'] = {
			['level'] = 31,
			['desc'] = '마비를 푸는 회복계열의 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 60}}
		},
		[CREATURE_SPELL(me:creature(), 3)] = {
			['level'] = 31,
			['desc'] = '두번째 신수마법의 다음 단계 기술로써, 적에게 더욱 강력한 공격을 가할수 있는 마법이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 70}, {['name'] = '호랑이고기', ['count'] = 10}}
		},
		['보호'] = {
			['level'] = 32,
			['desc'] = '일정시간 동안 모든 공격으로부터의 피해를 절반으로 줄여주는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 200}, {['name'] = '도토리', ['count'] = 70}, {['name'] = '호랑이고기', ['count'] = 20}}
		},
		['공력증강'] = {
			['level'] = 34,
			['desc'] = '소량의 마력과 일부 체력을 소모해, 마력을 완전히 회복시키는 마법이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 100}}
		},
		['구름의기원'] = {
			['level'] = 35,
			['desc'] = '자신이나 타인의 체력을 500만큼 회복시켜주는 마법이네.',
			['material'] = {{['name'] = '도토리', ['count'] = 100}, {['name'] = '웅담', ['count'] = 10}, {['name'] = '여우모피', ['count'] = 10}}
		},
		[CREATURE_AREA_SPELL(me:creature(), 3)] = {
			['level'] = 36,
			['desc'] = '자신의 전후좌우 방향으로 동시에 한층 강해진 신수마법을 시전하는 마법으로 많은 적을 공격 할 수 있다네.',
			['material'] = {{['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 100}, {['name'] = '여우모피', ['count'] = 10}}
		},
		['야수'] = {
			['level'] = 40,
			['desc'] = '여우,늑대로 변신하는 도적의 야수와 동일한 효과를 가지는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 200}, {['name'] = '도토리', ['count'] = 50}, {['name'] = '여우모피', ['count'] = 1}}
		},
		['퇴마주'] = {
			['level'] = 43,
			['desc'] = '저주를 푸는 회복계열의 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 200}, {['name'] = '도토리', ['count'] = 50}, {['name'] = '여우모피', ['count'] = 10}}
		},
		[CREATURE_SPELL(me:creature(), 4)] = {
			['level'] = 45,
			['desc'] = '세번째 신수마법의 다음 단계 기술로써, 적에게 더욱 강력한 공격을 가할수 있는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 500}, {['name'] = '도토리', ['count'] = 50}, {['name'] = '철도', ['count'] = 1}}
		},
		['맹수'] = {
			['level'] = 50,
			['desc'] = '곰,호랑이로 변신하는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 100}, {['name'] = '도토리', ['count'] = 70}}
		},
		['중독'] = {
			['level'] = 53,
			['desc'] = '대상을 맹독에 노출시켜 중독 상태로 만드는 저주 계열의 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 2000}, {['name'] = '도토리', ['count'] = 70}, {['name'] = '좋은뱀고기', ['count'] = 1}}
		},
		['저주'] = {
			['level'] = 55,
			['desc'] = '대상을 저주하여 방어력을 낮추는 저주 계열의 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 250}, {['name'] = '도토리', ['count'] = 70}, {['name'] = '자호의가죽', ['count'] = 10}}
		},
		['마비'] = {
			['level'] = 58,
			['desc'] = '상대를 얼려 움직이지 못하게 만드는 저주 계열의 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 300}, {['name'] = '도토리', ['count'] = 70}, {['name'] = '자호의가죽', ['count'] = 10}}
		},
		['절망'] = {
			['level'] = 60,
			['desc'] = '상대의 시력을 일정시간 동안 빼앗는 저주 계열의 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 400}, {['name'] = '도토리', ['count'] = 80}, {['name'] = '호박', ['count'] = 1} }
		},
		[CREATURE_AREA_SPELL(me:creature(), 4)] = {
			['level'] = 62,
			['desc'] = '자신의 전후좌우 방향으로 동시에 한층 가해진 신수마법을 시전하는 마법으로 많은 적을 공격 할 수 있다네.',
			['material'] = {{['name'] = '금전', ['count'] = 500}, {['name'] = '도토리', ['count'] = 70}, {['name'] = '호박', ['count'] = 1} }
		},
		['혼돈'] = {
			['level'] = 65,
			['desc'] = '희생자의 정신을 혼란시켜 아군을 공격하게 만드는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 600}, {['name'] = '도토리', ['count'] = 90}, {['name'] = '호박', ['count'] = 2}, {['name'] = '해골죽장', ['count'] = 1}}
		},
		[CREATURE_SPELL(me:creature(), 5)] = {
			['level'] = 74,
			['desc'] = '신수 속성을 가진 주술사의 최강의 원거리 공격 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 2000}, {['name'] = '도토리', ['count'] = 100}, {['name'] = '진호박', ['count'] = 1}}
		},
		[CREATURE_AREA_SPELL(me:creature(), 5)] = {
			['level'] = 85,
			['desc'] = '자신의 전후좌우 방향으로 동시에 한층 강해진 신수마법을 시전하는 마법으로 많은 적을 공격 할 수 있다네.',
			['material'] = {{['name'] = '금전', ['count'] = 2000}, {['name'] = '도토리', ['count'] = 100}, {['name'] = '진호박', ['count'] = 2}}
		},
		['사자후술사'] = {
			['level'] = 99,
			['desc'] = '목소리에 공력을 실어 크게 외치는 기술로써, 서버내 모든 유저들이 자신의 목소리를 들을 수 있게 해주는 기술이네.',
			['material'] = {{['name'] = '금전', ['count'] = 5000}, {['name'] = '도토리', ['count'] = 100}}
		},
		['헬파이어'] = {
			['level'] = 99,
			['desc'] = '주술사의 필살기로 모든 마력을 순간적으로 소모해 그에 비례하는 피해를 입히는 마법이네.',
			['material'] = {{['name'] = '금전', ['count'] = 5000}, {['name'] = '도토리', ['count'] = 100}, {['name'] = '진호박', ['count'] = 10}, {['name'] = '대마령봉', ['count'] = 1}}
		}
	}

	NPC_BASIC_CLASS(me, npc, CLASS.MAGE, spells)
end